ЛИС2/src/Catalogs/Водозаборы/Водозаборы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Водозаборы</name>
  <comment>В справочнике содержатся сведения об источниках водозабора предприятия.</comment>
  <attributes>
    <name>ПроектнаяПроизводительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВведенияВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭксплуатируетсяВНастоящееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыСевернойШироты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыВосточнойДолготы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВодныйОбъект</name>
    <type>
      <types>DefinedType.ИсточникиПриемникиВод</types>
    </type>
  </attributes>
  <attributes>
    <name>РасстояниеОтУстья</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияКачестваВоды</name>
    <type>
      <types>CatalogRef.КатегорииКачестваВоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидВодВодозабора</name>
    <type>
      <types>EnumRef.Удалить_ВидВодВодозабораВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>МуниципальныйРайон</name>
    <type>
      <types>CatalogRef.ОКТМО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКАТО</name>
    <type>
      <types>CatalogRef.ОКАТО</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТипаИсточникаПриемника</name>
    <type>
      <types>CatalogRef.КодыТипыИсточниковПриемников</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодохозяйственныйУчасток</name>
    <type>
      <types>CatalogRef.ВодохозяйственныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственнаяПлощадка</name>
    <type>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственностьСтороннейОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПунктыНаблюденияТочкиЗамера</name>
    <attributes>
      <name>НомерСтвора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоордСевШир</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоордВостДолг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресПунктаЗамера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПриборыВодоучета</name>
    <attributes>
      <name>ПриборУчетаВоды</name>
      <type>
        <types>CatalogRef.ПриборыУчетаИспользованияВоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Catalogs/КодыТипыИсточниковПриемников/КодыТипыИсточниковПриемников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КодыТипыИсточниковПриемников</name>
  <comment>В справочнике содержится перечень кодов и типов источников/приемников воды согласно Приложению №1 приказа Росстата от 19.10.2009 N 230 (ред. от 28.11.2011, с изм. от 05.05.2016)</comment>
  <predefined>
    <items>
      <name>Болото</name>
      <description>Болото</description>
    </items>
    <items>
      <name>ВодохранилищеНаливноеПрудНаливной</name>
      <description>Водохранилище наливное, пруд наливной</description>
    </items>
    <items>
      <name>ВодохранилищеРусловоеПрудРусловой</name>
      <description>Водохранилище русловое, пруд русловой</description>
    </items>
    <items>
      <name>ЗемледельческиеПоляОрошения</name>
      <description>Земледельческие поля орошения</description>
    </items>
    <items>
      <name>КаналКомплексногоНазначения</name>
      <description>Канал комплексного назначения</description>
    </items>
    <items>
      <name>КоллекторОросительнойСистемы</name>
      <description>Коллектор оросительной системы</description>
    </items>
    <items>
      <name>ЛивневойКоллектор</name>
      <description>Ливневой коллектор</description>
    </items>
    <items>
      <name>Море</name>
      <description>Море</description>
    </items>
    <items>
      <name>Накопитель</name>
      <description>Накопитель</description>
    </items>
    <items>
      <name>Озеро</name>
      <description>Озеро</description>
    </items>
    <items>
      <name>ПодземныйВодныйОбъект</name>
      <description>Подземный водный объект</description>
    </items>
    <items>
      <name>ПоляФильтрации</name>
      <description>Поля фильтрации</description>
    </items>
    <items>
      <name>Река</name>
      <description>Река</description>
    </items>
    <items>
      <name>РекаПересыхающая</name>
      <description>Река пересыхающая</description>
    </items>
    <items>
      <name>РельефМестности</name>
      <description>Рельеф местности</description>
    </items>
    <items>
      <name>СетьКанализации</name>
      <description>Сеть канализации</description>
    </items>
    <items>
      <name>СкважинаВертикальнаяУровняГрунтовыхВод</name>
      <description>Скважина вертикального дренажа для понижения уровня грунтовых вод</description>
    </items>
    <items>
      <name>ШахтаРудникНефтепромыселКарьер</name>
      <description>Шахта, рудник, нефтепромысел, карьер</description>
    </items>
  </predefined>
</mdclass:Catalog>

ЛИС2/src/Catalogs/Водозаборы/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокВидовВодныхОбъектовРасстояниеДоУстья() Экспорт 
	
	масСписокВидовВодныхОбъектов = Новый Массив;
	
	масСписокВидовВодныхОбъектов.Добавить( Справочники.КодыТипыИсточниковПриемников.Река );
	масСписокВидовВодныхОбъектов.Добавить( Справочники.КодыТипыИсточниковПриемников.ПодземныйВодныйОбъект );
	масСписокВидовВодныхОбъектов.Добавить( Справочники.КодыТипыИсточниковПриемников.ШахтаРудникНефтепромыселКарьер );
	
	Возврат масСписокВидовВодныхОбъектов;
	
КонецФункции

#КонецОбласти
